read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog uart_tx.v
synth -top uart_tx
dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr netlist_uart_tx.v
tee -o report_uart_tx.txt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
show -stretch -prefix ./netlist_schematic_uart_tx -format jpeg
